---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.RibbonItemEventArgs
source: html/9a5f3f57-b9d5-2ae1-8acd-26b864641e20.htm
---
# RibbonItemEventArgs Members

Initializes a new instance of the RibbonItemEventArgs class